Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_wifi.c
/****************************************************************************
 * vendor_esp32p4/chips/esp32p4/esp32p4_wifi.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * ESP-Hosted WiFi Driver for ESP32-P4 (NuttX)
 *
 * This driver implements WiFi connectivity for the ESP32-P4 SoC via the
 * ESP-Hosted protocol.  The ESP32-P4 has no built-in WiFi radio; instead,
 * an ESP32-C6 co-processor runs the WiFi firmware and communicates with
 * the ESP32-P4 host over SDIO.
 *
 * Architecture:
 *
 *   +------------------+       SDIO        +------------------+
 *   |    ESP32-P4      |<=================>|    ESP32-C6      |
 *   |  (NuttX Host)    |   4-bit SDIO bus  |  (WiFi FW Slave) |
 *   +------------------+                   +------------------+
 *   |  esp32p4_wifi.c  |                   |  ESP-Hosted FW   |
 *   |  - SDIO transport|                   |  - WiFi stack    |
 *   |  - ESP-Hosted    |                   |  - SDIO slave    |
 *   |    protocol      |                   |  - Command proc  |
 *   |  - NuttX netdev  |                   |                  |
 *   +------------------+                   +------------------+
 *
 * FreeRTOS to NuttX API Mapping:
 *   xTaskCreate        ->  nxtask_create / kthread_create
 *   xSemaphoreTake     ->  nxsem_wait / nxmutex_lock
 *   xSemaphoreGive     ->  nxsem_post / nxmutex_unlock
 *   vTaskDelay         ->  nxsig_usleep / up_mdelay
 *   xQueueSend         ->  nxsem_post (binary sem)
 *   xQueueReceive      ->  nxsem_wait (binary sem)
 *   pvPortMalloc       ->  kmm_malloc
 *   vPortFree          ->  kmm_free
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <sys/socket.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>
#include <time.h>

#include <nuttx/arch.h>
#include <nuttx/kmalloc.h>
#include <nuttx/wqueue.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>
#include <nuttx/net/netdev.h>
#include <nuttx/net/ethernet.h>
#include <nuttx/net/net.h>
#include <nuttx/sdio.h>
#include <nuttx/irq.h>
#include <nuttx/wireless/wireless.h>

#include "esp32p4_wifi.h"
#include "esp32p4_sdmmc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define WIFI_TAG "esp32p4_wifi"

/* Debug levels */

#ifdef CONFIG_DEBUG_WIRELESS_ERROR
#  define wifierr(fmt, ...)   _err(fmt, ##__VA_ARGS__)
#else
#  define wifierr(fmt, ...)
#endif

#ifdef CONFIG_DEBUG_WIRELESS_WARN
#  define wifiwarn(fmt, ...)  _warn(fmt, ##__VA_ARGS__)
#else
#  define wifiwarn(fmt, ...)
#endif

#ifdef CONFIG_DEBUG_WIRELESS_INFO
#  define wifiinfo(fmt, ...)  _info(fmt, ##__VA_ARGS__)
#else
#  define wifiinfo(fmt, ...)
#endif

/* Work queue for WiFi event processing */

#define ESP_WIFI_WORK_LP         0  /* Low priority work queue */
#define ESP_WIFI_WORK_THREADNAME "esp_wifi_wq"

/* Sequence number increment */

#define SEQ_NEXT(s)              ((uint8_t)(((s) + 1) & 0xff))

/* SDIO function number for ESP32-C6 WiFi data */

#define ESP_HOSTED_SDIO_FUNC     1

/* Interrupt handling */

#define ESP_WIFI_POLL_INTERVAL   50  /* ms - polling SDIO for data */

/* TX/RX buffer management */

#define ESP_WIFI_TX_BUFFERS      4
#define ESP_WIFI_RX_BUFFERS      8
#define ESP_WIFI_TXQ_DEPTH       4

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Driver operating mode */

enum esp_wifi_mode_e
{
  ESP_WIFI_MODE_OFF = 0,
  ESP_WIFI_MODE_STA,
  ESP_WIFI_MODE_AP,
  ESP_WIFI_MODE_STA_AP
};

/* Pending command state */

struct esp_wifi_cmd_ctx_s
{
  sem_t        sem;             /* Completion semaphore */
  uint8_t      cmd_id;          /* Outstanding command ID */
  uint16_t     seq;             /* Command sequence number */
  int          status;          /* Result status */
  uint8_t     *resp_buf;        /* Response buffer (points to caller buf) */
  uint16_t     resp_buf_len;    /* Response buffer size */
  uint16_t     resp_data_len;   /* Actual response data length */
  bool         pending;         /* True if a command is in flight */
};

/* Network device private data */

struct esp_wifi_priv_s
{
  /* NuttX net device -- must be first */

  struct net_driver_s       dev;

  /* Driver state */

  enum esp_hosted_state_e   state;
  enum esp_wifi_mode_e      mode;

  /* Mutex protecting the driver */

  mutex_t                   lock;

  /* Command context */

  struct esp_wifi_cmd_ctx_s cmd;

  /* SDIO device handle */

  struct sdio_dev_s        *sdio;

  /* Sequence numbers */

  uint8_t                   tx_seq;
  uint8_t                   rx_seq;

  /* MAC addresses */

  uint8_t                   sta_mac[ESP_HOSTED_MAC_ADDR_LEN];
  uint8_t                   ap_mac[ESP_HOSTED_MAC_ADDR_LEN];

