Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_wifi.c
  /* Scan results */

  struct esp_hosted_scan_result_s
                            *scan_results;
  uint8_t                   scan_count;
  sem_t                     scan_sem;

  /* Connection state */

  bool                      sta_connected;
  int8_t                    rssi;

  /* Work queues for deferred processing */

  struct work_s             poll_work;
  struct work_s             event_work;

  /* TX buffer management */

  uint8_t                  *tx_buf;
  size_t                    tx_buf_size;

  /* RX buffer */

  uint8_t                  *rx_buf;
  size_t                    rx_buf_size;

  /* Statistics */

  uint32_t                  tx_packets;
  uint32_t                  rx_packets;
  uint32_t                  tx_errors;
  uint32_t                  rx_errors;
  uint32_t                  tx_dropped;
  uint32_t                  cmd_timeouts;

  /* Firmware version info */

  uint8_t                   fw_version_major;
  uint8_t                   fw_version_minor;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* SDIO transport layer */

static int  esp_wifi_sdio_init(struct esp_wifi_priv_s *priv);
static int  esp_wifi_sdio_send_frame(struct esp_wifi_priv_s *priv,
                uint8_t type, uint8_t iface, const uint8_t *payload,
                uint16_t payload_len);
static int  esp_wifi_sdio_recv_frame(struct esp_wifi_priv_s *priv,
                uint8_t *buf, uint16_t buf_size, uint16_t *frame_len,
                uint32_t timeout_ms);
static int  esp_wifi_sdio_read_reg(struct esp_wifi_priv_s *priv,
                uint8_t reg, uint8_t *value);
static int  esp_wifi_sdio_write_reg(struct esp_wifi_priv_s *priv,
                uint8_t reg, uint8_t value);

/* ESP-Hosted protocol layer */

static int  esp_wifi_fw_handshake(struct esp_wifi_priv_s *priv);
static int  esp_wifi_send_command(struct esp_wifi_priv_s *priv,
                uint8_t cmd_id, const uint8_t *cmd_payload,
                uint16_t cmd_len, uint8_t *resp_payload,
                uint16_t resp_buf_len, uint16_t *resp_data_len,
                uint32_t timeout_ms);
static void esp_wifi_process_event(struct esp_wifi_priv_s *priv,
                const uint8_t *payload, uint16_t len);
static void esp_wifi_process_response(struct esp_wifi_priv_s *priv,
                const uint8_t *payload, uint16_t len);

/* NuttX netdev interface */

static int  esp_wifi_ifup(struct net_driver_s *dev);
static int  esp_wifi_ifdown(struct net_driver_s *dev);
static int  esp_wifi_transmit(struct net_driver_s *dev);
static int  esp_wifi_txpoll(struct net_driver_s *dev);
#ifdef CONFIG_NET_MCASTGROUP
static int  esp_wifi_addmac(struct net_driver_s *dev,
                const uint8_t *mac);
static int  esp_wifi_rmmac(struct net_driver_s *dev,
                const uint8_t *mac);
#endif
#ifdef CONFIG_NETDEV_IOCTL
static int  esp_wifi_ioctl(struct net_driver_s *dev, int cmd,
                unsigned long arg);
#endif

/* Work queue handlers */

static void esp_wifi_poll_worker(void *arg);
static void esp_wifi_event_worker(void *arg);

/* Utility functions */

static int  esp_wifi_wait_for_connection(struct esp_wifi_priv_s *priv,
                uint32_t timeout_ms);
static void esp_wifi_update_link_status(struct esp_wifi_priv_s *priv,
                bool up);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Singleton driver instance */

static struct esp_wifi_priv_s g_esp_wifi;

/* Net device operations */

static const struct netdev_ops_s g_esp_wifi_ops =
{
  .ifup     = esp_wifi_ifup,
  .ifdown   = esp_wifi_ifdown,
  .transmit = esp_wifi_transmit,
  .txpoll   = esp_wifi_txpoll,
#ifdef CONFIG_NET_MCASTGROUP
  .addmac   = esp_wifi_addmac,
  .rmmac    = esp_wifi_rmmac,
#endif
#ifdef CONFIG_NETDEV_IOCTL
  .ioctl    = esp_wifi_ioctl,
#endif
};

/****************************************************************************
 * Private Functions - SDIO Transport Layer
 ****************************************************************************/

/****************************************************************************
 * Name: esp_wifi_sdio_init
 *
 * Description:
 *   Initialize the SDIO interface for communication with ESP32-C6.
 *
 ****************************************************************************/

static int esp_wifi_sdio_init(struct esp_wifi_priv_s *priv)
{
  struct sdio_dev_s *sdio;
  int ret;

  wifiinfo("Initializing SDIO for ESP-Hosted\n");

  /* Initialize the SDMMC controller in SDIO mode */

  sdio = sdmmc_initialize(0);
  if (sdio == NULL)
    {
      wifierr("ERROR: Failed to initialize SDMMC controller\n");
      return -ENODEV;
    }

  priv->sdio = sdio;

  /* Select SDIO function 1 (ESP32-C6 WiFi) */

  sdio->lock(sdio, true);

  /* Set SDIO bus clock to initialization frequency (400 kHz) */

  ret = sdio->sendcmd(sdio, SDIO_CMD5, 0);
  if (ret < 0)
    {
      wifierr("ERROR: SDIO CMD5 (IO_SEND_OP_COND) failed: %d\n", ret);
      sdio->lock(sdio, false);
      return ret;
    }

  /* Wait for SDIO card to be ready */

  uint32_t ocr;
  int retries = 100;
  do
    {
      ret = sdio->sendcmd(sdio, SDIO_CMD5, 0x00ff8000);
      if (ret < 0)
        {
          up_mdelay(10);
          retries--;
          continue;
        }

      ret = sdio->recvshortocr(sdio, &ocr);
      if (ret < 0 || retries <= 0)
        {
          wifierr("ERROR: SDIO OCR negotiation failed: %d\n", ret);
          sdio->lock(sdio, false);
          return ret < 0 ? ret : -ETIMEDOUT;
        }

      if (ocr & (1 << 31))
        {
          break;  /* Card is ready */
        }

      up_mdelay(10);
      retries--;
    }
  while (retries > 0);

  /* Set relative address (CMD3) */

  ret = sdio->sendcmd(sdio, SDIO_CMD3, 0);
  if (ret < 0)
    {
      wifierr("ERROR: SDIO CMD3 failed: %d\n", ret);
      sdio->lock(sdio, false);
      return ret;
    }

