Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_wifi.c
  /* Select the card (CMD7) */

  ret = sdio->sendcmd(sdio, SDIO_CMD7, 0);
  if (ret < 0)
    {
      wifierr("ERROR: SDIO CMD7 failed: %d\n", ret);
      sdio->lock(sdio, false);
      return ret;
    }

  /* Set bus width to 4-bit for higher throughput */

  sdio_set_bus_width(4);

  /* Increase clock to operational frequency */

  sdio_set_clock(CONFIG_ESP32P4_WIFI_SDIO_FREQ);

  sdio->lock(sdio, false);

  wifiinfo("SDIO initialized successfully\n");

  return OK;
}

/****************************************************************************
 * Name: esp_wifi_sdio_read_reg
 *
 * Description:
 *   Read a single byte from an SDIO register.
 *
 ****************************************************************************/

static int esp_wifi_sdio_read_reg(struct esp_wifi_priv_s *priv,
                                  uint8_t reg, uint8_t *value)
{
  struct sdio_dev_s *sdio = priv->sdio;
  uint32_t arg;
  uint32_t resp;
  int ret;

  /* SDIO CMD52 read: arg = 0 | (func << 28) | (raw << 27) | (reg << 9) */

  arg = (ESP_HOSTED_SDIO_FUNC << 28) | (reg << 9);

  sdio->lock(sdio, true);

  ret = sdio->sendcmd(sdio, SDIO_CMD52, arg);
  if (ret < 0)
    {
      sdio->lock(sdio, false);
      return ret;
    }

  ret = sdio->recvshort(sdio, &resp);
  if (ret < 0)
    {
      sdio->lock(sdio, false);
      return ret;
    }

  /* Response data is in bits [7:0] of the R5 response */

  *value = (uint8_t)(resp & 0xff);

  sdio->lock(sdio, false);

  return OK;
}

/****************************************************************************
 * Name: esp_wifi_sdio_write_reg
 *
 * Description:
 *   Write a single byte to an SDIO register.
 *
 ****************************************************************************/

static int esp_wifi_sdio_write_reg(struct esp_wifi_priv_s *priv,
                                   uint8_t reg, uint8_t value)
{
  struct sdio_dev_s *sdio = priv->sdio;
  uint32_t arg;
  int ret;

  /* SDIO CMD52 write: arg = 1 | (func << 28) | (reg << 9) | value */

  arg = (1 << 31) | (ESP_HOSTED_SDIO_FUNC << 28) | (reg << 9) | value;

  sdio->lock(sdio, true);

  ret = sdio->sendcmd(sdio, SDIO_CMD52, arg);
  if (ret < 0)
    {
      sdio->lock(sdio, false);
      return ret;
    }

  sdio->lock(sdio, false);

  return OK;
}

/****************************************************************************
 * Name: esp_wifi_sdio_send_frame
 *
 * Description:
 *   Send a frame to ESP32-C6 over SDIO.
 *
 ****************************************************************************/

static int esp_wifi_sdio_send_frame(struct esp_wifi_priv_s *priv,
                                    uint8_t type, uint8_t iface,
                                    const uint8_t *payload,
                                    uint16_t payload_len)
{
  struct sdio_dev_s *sdio = priv->sdio;
  struct esp_hosted_frame_hdr_s hdr;
  uint16_t total_len;
  int ret;

  if (payload_len > ESP_HOSTED_MAX_FRAME_SIZE)
    {
      wifierr("ERROR: Frame too large: %u\n", payload_len);
      return -EINVAL;
    }

  /* Build frame header */

  memset(&hdr, 0, sizeof(hdr));
  hdr.type        = type;
  hdr.iface       = iface;
  hdr.seq         = priv->tx_seq;
  hdr.flags       = 0;
  hdr.payload_len = payload_len;
  hdr.reserved    = 0;

  priv->tx_seq = SEQ_NEXT(priv->tx_seq);

  /* Assemble the complete frame in TX buffer */

  total_len = ESP_HOSTED_FRAME_HDR_SIZE + payload_len;

  /* Align to SDIO block size */

  uint16_t aligned_len = (total_len + ESP_HOSTED_SDIO_BLOCK_SIZE - 1) &
                         ~(ESP_HOSTED_SDIO_BLOCK_SIZE - 1);

  if (aligned_len > priv->tx_buf_size)
    {
      wifierr("ERROR: TX buffer overflow: %u > %zu\n",
              aligned_len, priv->tx_buf_size);
      return -ENOMEM;
    }

  memcpy(priv->tx_buf, &hdr, ESP_HOSTED_FRAME_HDR_SIZE);
  if (payload_len > 0 && payload != NULL)
    {
      memcpy(priv->tx_buf + ESP_HOSTED_FRAME_HDR_SIZE,
             payload, payload_len);
    }

  /* Pad to block boundary */

  if (aligned_len > total_len)
    {
      memset(priv->tx_buf + total_len, 0, aligned_len - total_len);
    }

  /* Signal ESP32-C6 that data is ready to read */

  esp_wifi_sdio_write_reg(priv, 0x01, 0x01);

  /* Send data via SDIO block write (CMD53) */

  sdio->lock(sdio, true);

  ret = sdio->sendsetup(sdio, (const uint32_t *)priv->tx_buf,
                        aligned_len);
  if (ret < 0)
    {
      sdio->lock(sdio, false);
      wifierr("ERROR: SDIO sendsetup failed: %d\n", ret);
      priv->tx_errors++;
      return ret;
    }

  /* Issue CMD53 write: multi-block to function 1, address 0 */

  uint32_t cmd53_arg = (1 << 31) |             /* R/W = write */
                       (ESP_HOSTED_SDIO_FUNC << 28) |  /* Function */
                       (0 << 27) |             /* Block mode */
                       (0 << 26) |             /* Fixed address */
                       (0 << 9)  |             /* Address */
                       (aligned_len / ESP_HOSTED_SDIO_BLOCK_SIZE);

  ret = sdio->sendcmd(sdio, SDIO_CMD53, cmd53_arg);
  if (ret < 0)
    {
      sdio->lock(sdio, false);
      wifierr("ERROR: SDIO CMD53 write failed: %d\n", ret);
      priv->tx_errors++;
      return ret;
    }

  sdio->lock(sdio, false);

  return OK;
}

/****************************************************************************
 * Name: esp_wifi_sdio_recv_frame
 *
 * Description:
 *   Receive a frame from ESP32-C6 over SDIO.
 *
 ****************************************************************************/

static int esp_wifi_sdio_recv_frame(struct esp_wifi_priv_s *priv,
                                    uint8_t *buf, uint16_t buf_size,
                                    uint16_t *frame_len,
                                    uint32_t timeout_ms)
{
  struct sdio_dev_s *sdio = priv->sdio;
  struct esp_hosted_frame_hdr_s *hdr;
  uint32_t start_tick;
  uint32_t elapsed;
  uint8_t int_status;
  int ret;

  start_tick = clock_systime_ticks();

  /* Poll for data ready indication from ESP32-C6 */

  while (true)
    {
      /* Check if slave has data ready (interrupt status register) */

      ret = esp_wifi_sdio_read_reg(priv, 0x04, &int_status);
      if (ret < 0)
        {
          return ret;
        }

      if (int_status & 0x01)
        {
          break;  /* Data ready */
        }

      /* Check timeout */

      elapsed = TICK2MSEC(clock_systime_ticks() - start_tick);
      if (elapsed >= timeout_ms)
        {
          return -ETIMEDOUT;
        }

      up_mdelay(1);
    }

  /* Read frame via SDIO block read (CMD53) */

  uint16_t read_len = ESP_HOSTED_SDIO_BLOCK_SIZE;
  if (read_len > buf_size)
    {
      read_len = buf_size;
    }

