Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_wifi.c
  sdio->lock(sdio, true);

  ret = sdio->recvsetup(sdio, (uint32_t *)buf, read_len);
  if (ret < 0)
    {
      sdio->lock(sdio, false);
      wifierr("ERROR: SDIO recvsetup failed: %d\n", ret);
      return ret;
    }

  /* Issue CMD53 read: multi-block from function 1, address 0 */

  uint32_t cmd53_arg = (0 << 31) |             /* R/W = read */
                       (ESP_HOSTED_SDIO_FUNC << 28) |  /* Function */
                       (0 << 27) |             /* Block mode */
                       (0 << 26) |             /* Fixed address */
                       (0 << 9)  |             /* Address */
                       (read_len / ESP_HOSTED_SDIO_BLOCK_SIZE);

  ret = sdio->sendcmd(sdio, SDIO_CMD53, cmd53_arg);
  if (ret < 0)
    {
      sdio->lock(sdio, false);
      wifierr("ERROR: SDIO CMD53 read failed: %d\n", ret);
      return ret;
    }

  sdio->lock(sdio, false);

  /* Parse frame header */

  hdr = (struct esp_hosted_frame_hdr_s *)buf;

  /* Validate frame */

  if (hdr->payload_len > ESP_HOSTED_MAX_FRAME_SIZE)
    {
      wifierr("ERROR: Invalid frame payload length: %u\n",
              hdr->payload_len);
      return -EPROTO;
    }

  *frame_len = ESP_HOSTED_FRAME_HDR_SIZE + hdr->payload_len;

  /* Update rx sequence */

  priv->rx_seq = hdr->seq;

  return OK;
}

/****************************************************************************
 * Private Functions - ESP-Hosted Protocol Layer
 ****************************************************************************/

/****************************************************************************
 * Name: esp_wifi_fw_handshake
 *
 * Description:
 *   Perform firmware handshake with ESP32-C6 to establish communication.
 *
 ****************************************************************************/

static int esp_wifi_fw_handshake(struct esp_wifi_priv_s *priv)
{
  uint8_t resp_buf[ESP_HOSTED_MAX_RESP_SIZE];
  uint16_t resp_len;
  int ret;
  int retries = 50;

  wifiinfo("Starting firmware handshake with ESP32-C6\n");

  /* Wait for ESP32-C6 to signal readiness */

  while (retries-- > 0)
    {
      uint8_t ready;
      ret = esp_wifi_sdio_read_reg(priv, 0x00, &ready);
      if (ret == OK && (ready & 0x01))
        {
          break;
        }

      up_mdelay(100);
    }

  if (retries <= 0)
    {
      wifierr("ERROR: ESP32-C6 not responding\n");
      return -ETIMEDOUT;
    }

  /* Send a get-MAC command as a handshake check */

  ret = esp_wifi_send_command(priv, ESP_HOSTED_CMD_GET_MAC,
                              NULL, 0,
                              resp_buf, sizeof(resp_buf), &resp_len,
                              ESP_HOSTED_CMD_TIMEOUT_MS);
  if (ret < 0)
    {
      wifierr("ERROR: Handshake command failed: %d\n", ret);
      return ret;
    }

  if (resp_len >= sizeof(struct esp_hosted_mac_resp_s))
    {
      struct esp_hosted_mac_resp_s *mac_resp =
        (struct esp_hosted_mac_resp_s *)resp_buf;
      memcpy(priv->sta_mac, mac_resp->mac, ESP_HOSTED_MAC_ADDR_LEN);
      wifiinfo("STA MAC: %02x:%02x:%02x:%02x:%02x:%02x\n",
               priv->sta_mac[0], priv->sta_mac[1], priv->sta_mac[2],
               priv->sta_mac[3], priv->sta_mac[4], priv->sta_mac[5]);
    }

  priv->state = ESP_HOSTED_STATE_FW_READY;
  wifiinfo("Firmware handshake completed\n");

  return OK;
}

/****************************************************************************
 * Name: esp_wifi_send_command
 *
 * Description:
 *   Send a command to ESP32-C6 and wait for the response.
 *
 ****************************************************************************/

static int esp_wifi_send_command(struct esp_wifi_priv_s *priv,
                                 uint8_t cmd_id,
                                 const uint8_t *cmd_payload,
                                 uint16_t cmd_len,
                                 uint8_t *resp_payload,
                                 uint16_t resp_buf_len,
                                 uint16_t *resp_data_len,
                                 uint32_t timeout_ms)
{
  struct esp_wifi_cmd_ctx_s *cmd = &priv->cmd;
  uint8_t cmd_buf[ESP_HOSTED_MAX_CMD_SIZE];
  struct esp_hosted_cmd_hdr_s *cmd_hdr;
  int ret;

  /* Build command buffer: header + payload */

  if (sizeof(struct esp_hosted_cmd_hdr_s) + cmd_len >
      ESP_HOSTED_MAX_CMD_SIZE)
    {
      return -EINVAL;
    }

  cmd_hdr = (struct esp_hosted_cmd_hdr_s *)cmd_buf;
  cmd_hdr->cmd_id = cmd_id;
  cmd_hdr->status = 0;
  cmd_hdr->seq    = priv->cmd.seq;

  if (cmd_len > 0 && cmd_payload != NULL)
    {
      memcpy(cmd_buf + sizeof(struct esp_hosted_cmd_hdr_s),
             cmd_payload, cmd_len);
    }

  /* Set up command context for synchronous wait */

  nxsem_reset(&cmd->sem, 0);
  cmd->cmd_id      = cmd_id;
  cmd->seq         = priv->cmd.seq;
  cmd->status      = -ETIMEDOUT;
  cmd->resp_buf    = resp_payload;
  cmd->resp_buf_len = resp_buf_len;
  cmd->resp_data_len = 0;
  cmd->pending     = true;

  priv->cmd.seq++;

  /* Send the command frame */

  ret = esp_wifi_sdio_send_frame(priv, ESP_HOSTED_FRAME_TYPE_CMD,
                                 ESP_HOSTED_IFACE_STA,
                                 cmd_buf,
                                 sizeof(struct esp_hosted_cmd_hdr_s) +
                                 cmd_len);
  if (ret < 0)
    {
      cmd->pending = false;
      wifierr("ERROR: Failed to send command %02x: %d\n", cmd_id, ret);
      return ret;
    }

  /* Wait for response */

  ret = nxsem_tickwait(&cmd->sem, MSEC2TICK(timeout_ms));
  if (ret < 0)
    {
      cmd->pending = false;
      if (ret == -ETIMEDOUT)
        {
          wifierr("ERROR: Command %02x timed out\n", cmd_id);
          priv->cmd_timeouts++;
        }

      return ret;
    }

  /* Check command status */

  if (cmd->status != ESP_HOSTED_STATUS_SUCCESS)
    {
      wifierr("ERROR: Command %02x failed with status %d\n",
              cmd_id, cmd->status);
      return -EIO;
    }

  /* Return response data */

  if (resp_data_len != NULL)
    {
      *resp_data_len = cmd->resp_data_len;
    }

  return OK;
}

/****************************************************************************
 * Name: esp_wifi_process_response
 *
 * Description:
 *   Process a response frame from ESP32-C6.
 *
 ****************************************************************************/

static void esp_wifi_process_response(struct esp_wifi_priv_s *priv,
                                      const uint8_t *payload,
                                      uint16_t len)
{
  struct esp_wifi_cmd_ctx_s *cmd = &priv->cmd;
  const struct esp_hosted_cmd_hdr_s *resp_hdr;

  if (len < sizeof(struct esp_hosted_cmd_hdr_s))
    {
      wifierr("ERROR: Response too short: %u\n", len);
      return;
    }

  resp_hdr = (const struct esp_hosted_cmd_hdr_s *)payload;

  if (!cmd->pending)
    {
      wifiwarn("WARNING: Unexpected response, no pending command\n");
      return;
    }

  /* Verify this is the response we are waiting for */

  if (resp_hdr->cmd_id != cmd->cmd_id)
    {
      wifiwarn("WARNING: Response cmd_id mismatch: %02x != %02x\n",
               resp_hdr->cmd_id, cmd->cmd_id);
      return;
    }

  /* Copy response status and data */

