Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_wifi.c
  cmd->status = resp_hdr->status;

  uint16_t data_len = len - sizeof(struct esp_hosted_cmd_hdr_s);
  if (data_len > 0 && cmd->resp_buf != NULL && cmd->resp_buf_len > 0)
    {
      uint16_t copy_len = data_len;
      if (copy_len > cmd->resp_buf_len)
        {
          copy_len = cmd->resp_buf_len;
        }

      memcpy(cmd->resp_buf,
             payload + sizeof(struct esp_hosted_cmd_hdr_s),
             copy_len);
      cmd->resp_data_len = copy_len;
    }

  cmd->pending = false;

  /* Signal the waiting thread */

  nxsem_post(&cmd->sem);
}

/****************************************************************************
 * Name: esp_wifi_process_event
 *
 * Description:
 *   Process an event frame from ESP32-C6.
 *
 ****************************************************************************/

static void esp_wifi_process_event(struct esp_wifi_priv_s *priv,
                                   const uint8_t *payload,
                                   uint16_t len)
{
  uint8_t event_id;

  if (len < 1)
    {
      return;
    }

  event_id = payload[0];

  wifiinfo("Received event: 0x%02x\n", event_id);

  switch (event_id)
    {
      case ESP_HOSTED_EVT_STA_CONNECTED:
        {
          wifiinfo("STA connected to AP\n");
          priv->sta_connected = true;
          priv->state = ESP_HOSTED_STATE_STA_CONNECTED;
          esp_wifi_update_link_status(priv, true);
          break;
        }

      case ESP_HOSTED_EVT_STA_DISCONNECTED:
        {
          wifiinfo("STA disconnected from AP\n");
          priv->sta_connected = false;
          priv->state = ESP_HOSTED_STATE_STA_DISCONNECTED;
          esp_wifi_update_link_status(priv, false);
          break;
        }

      case ESP_HOSTED_EVT_AP_STA_CONNECTED:
        {
          if (len >= 1 + sizeof(struct esp_hosted_evt_ap_sta_s))
            {
              const struct esp_hosted_evt_ap_sta_s *evt =
                (const struct esp_hosted_evt_ap_sta_s *)(payload + 1);
              wifiinfo("Station connected to AP: "
                       "%02x:%02x:%02x:%02x:%02x:%02x (AID=%u)\n",
                       evt->mac[0], evt->mac[1], evt->mac[2],
                       evt->mac[3], evt->mac[4], evt->mac[5],
                       evt->aid);
            }

          break;
        }

      case ESP_HOSTED_EVT_AP_STA_DISCONNECTED:
        {
          if (len >= 1 + sizeof(struct esp_hosted_evt_ap_sta_s))
            {
              const struct esp_hosted_evt_ap_sta_s *evt =
                (const struct esp_hosted_evt_ap_sta_s *)(payload + 1);
              wifiinfo("Station disconnected from AP: "
                       "%02x:%02x:%02x:%02x:%02x:%02x\n",
                       evt->mac[0], evt->mac[1], evt->mac[2],
                       evt->mac[3], evt->mac[4], evt->mac[5]);
            }

          break;
        }

      case ESP_HOSTED_EVT_SCAN_DONE:
        {
          wifiinfo("Scan completed\n");
          nxsem_post(&priv->scan_sem);
          break;
        }

      default:
        {
          wifiwarn("WARNING: Unknown event: 0x%02x\n", event_id);
          break;
        }
    }
}

/****************************************************************************
 * Private Functions - Work Queue Handlers
 ****************************************************************************/

/****************************************************************************
 * Name: esp_wifi_poll_worker
 *
 * Description:
 *   Periodically poll SDIO for incoming frames from ESP32-C6.
 *
 ****************************************************************************/

static void esp_wifi_poll_worker(void *arg)
{
  struct esp_wifi_priv_s *priv = (struct esp_wifi_priv_s *)arg;
  uint16_t frame_len;
  struct esp_hosted_frame_hdr_s *hdr;
  int ret;

  if (priv->state < ESP_HOSTED_STATE_FW_READY)
    {
      goto reschedule;
    }

  /* Try to receive a frame */

  ret = esp_wifi_sdio_recv_frame(priv, priv->rx_buf,
                                 priv->rx_buf_size,
                                 &frame_len, 10);
  if (ret == OK && frame_len >= ESP_HOSTED_FRAME_HDR_SIZE)
    {
      hdr = (struct esp_hosted_frame_hdr_s *)priv->rx_buf;

      switch (hdr->type)
        {
          case ESP_HOSTED_FRAME_TYPE_DATA:
            {
              /* Ethernet data frame - deliver to network stack */

              priv->rx_packets++;

              if (hdr->payload_len > 0 &&
                  hdr->payload_len <= CONFIG_NET_ETH_PKTSIZE)
                {
                  net_lock();
                  memcpy(priv->dev.d_buf,
                         priv->rx_buf + ESP_HOSTED_FRAME_HDR_SIZE,
                         hdr->payload_len);
                  priv->dev.d_len = hdr->payload_len;
                  priv->dev.d_appdata = priv->dev.d_buf;
                  ipv4_input(&priv->dev);
                  net_unlock();
                }

              break;
            }

          case ESP_HOSTED_FRAME_TYPE_RESP:
            {
              esp_wifi_process_response(priv,
                priv->rx_buf + ESP_HOSTED_FRAME_HDR_SIZE,
                hdr->payload_len);
              break;
            }

          case ESP_HOSTED_FRAME_TYPE_EVENT:
            {
              esp_wifi_process_event(priv,
                priv->rx_buf + ESP_HOSTED_FRAME_HDR_SIZE,
                hdr->payload_len);
              break;
            }

          default:
            {
              wifiwarn("WARNING: Unknown frame type: 0x%02x\n",
                       hdr->type);
              break;
            }
        }
    }

reschedule:

  /* Re-schedule the poll work */

  work_queue(ESP_WIFI_WORK_LP, &priv->poll_work,
             esp_wifi_poll_worker, priv,
             MSEC2TICK(ESP_WIFI_POLL_INTERVAL));
}

/****************************************************************************
 * Private Functions - NuttX netdev Interface
 ****************************************************************************/

/****************************************************************************
 * Name: esp_wifi_ifup
 *
 * Description:
 *   Bring the WiFi network interface up.
 *
 ****************************************************************************/

static int esp_wifi_ifup(struct net_driver_s *dev)
{
  struct esp_wifi_priv_s *priv = (struct esp_wifi_priv_s *)dev;
  int ret;

  wifiinfo("Bringing wlan0 up\n");

  nxmutex_lock(&priv->lock);

  if (priv->state < ESP_HOSTED_STATE_FW_READY)
    {
      nxmutex_unlock(&priv->lock);
      wifierr("ERROR: Firmware not ready\n");
      return -ENODEV;
    }

  /* Set WiFi mode to STA */

  ret = esp_wifi_send_command(priv, ESP_HOSTED_CMD_SET_MODE,
                              (const uint8_t *)
                                &(uint8_t){ESP_HOSTED_WIFI_MODE_STA},
                              1, NULL, 0, NULL,
                              ESP_HOSTED_CMD_TIMEOUT_MS);
  if (ret < 0)
    {
      wifierr("ERROR: Failed to set WiFi mode: %d\n", ret);
      nxmutex_unlock(&priv->lock);
      return ret;
    }

  priv->mode = ESP_WIFI_MODE_STA;
  priv->state = ESP_HOSTED_STATE_STA_DISCONNECTED;

  /* Start the poll worker */

