Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_wifi.c
  work_queue(ESP_WIFI_WORK_LP, &priv->poll_work,
             esp_wifi_poll_worker, priv,
             MSEC2TICK(ESP_WIFI_POLL_INTERVAL));

  /* Set MAC address in net device */

  memcpy(dev->d_mac.ether.ether_addr_octet,
         priv->sta_mac, ESP_HOSTED_MAC_ADDR_LEN);

  nxmutex_unlock(&priv->lock);

  wifiinfo("wlan0 is up\n");

  return OK;
}

/****************************************************************************
 * Name: esp_wifi_ifdown
 *
 * Description:
 *   Bring the WiFi network interface down.
 *
 ****************************************************************************/

static int esp_wifi_ifdown(struct net_driver_s *dev)
{
  struct esp_wifi_priv_s *priv = (struct esp_wifi_priv_s *)dev;
  int ret;

  wifiinfo("Bringing wlan0 down\n");

  nxmutex_lock(&priv->lock);

  /* Stop poll worker */

  work_cancel(ESP_WIFI_WORK_LP, &priv->poll_work);

  /* Disconnect if connected */

  if (priv->sta_connected)
    {
      esp_wifi_send_command(priv, ESP_HOSTED_CMD_DISCONNECT,
                            NULL, 0, NULL, 0, NULL,
                            ESP_HOSTED_CMD_TIMEOUT_MS);
      priv->sta_connected = false;
    }

  /* Set mode to NULL */

  ret = esp_wifi_send_command(priv, ESP_HOSTED_CMD_SET_MODE,
                              (const uint8_t *)
                                &(uint8_t){ESP_HOSTED_WIFI_MODE_NULL},
                              1, NULL, 0, NULL,
                              ESP_HOSTED_CMD_TIMEOUT_MS);

  priv->mode = ESP_WIFI_MODE_OFF;
  priv->state = ESP_HOSTED_STATE_FW_READY;

  esp_wifi_update_link_status(priv, false);

  nxmutex_unlock(&priv->lock);

  wifiinfo("wlan0 is down\n");

  return OK;
}

/****************************************************************************
 * Name: esp_wifi_transmit
 *
 * Description:
 *   Transmit a packet through the WiFi interface.
 *
 ****************************************************************************/

static int esp_wifi_transmit(struct net_driver_s *dev)
{
  struct esp_wifi_priv_s *priv = (struct esp_wifi_priv_s *)dev;
  int ret;

  if (priv->state != ESP_HOSTED_STATE_STA_CONNECTED &&
      priv->state != ESP_HOSTED_STATE_AP_ACTIVE)
    {
      priv->tx_dropped++;
      return -ENOTCONN;
    }

  /* Send Ethernet frame as a DATA frame via SDIO */

  ret = esp_wifi_sdio_send_frame(priv, ESP_HOSTED_FRAME_TYPE_DATA,
                                 ESP_HOSTED_IFACE_STA,
                                 dev->d_buf, dev->d_len);
  if (ret < 0)
    {
      priv->tx_errors++;
      return ret;
    }

  priv->tx_packets++;

  return OK;
}

/****************************************************************************
 * Name: esp_wifi_txpoll
 *
 * Description:
 *   Poll for TX data availability.
 *
 ****************************************************************************/

static int esp_wifi_txpoll(struct net_driver_s *dev)
{
  /* Return OK to indicate we can accept more data */

  return OK;
}

#ifdef CONFIG_NET_MCASTGROUP

/****************************************************************************
 * Name: esp_wifi_addmac
 *
 * Description:
 *   Add a multicast MAC address filter.
 *
 ****************************************************************************/

static int esp_wifi_addmac(struct net_driver_s *dev,
                           const uint8_t *mac)
{
  /* ESP-Hosted handles multicast at the firmware level */

  return OK;
}

/****************************************************************************
 * Name: esp_wifi_rmmac
 *
 * Description:
 *   Remove a multicast MAC address filter.
 *
 ****************************************************************************/

static int esp_wifi_rmmac(struct net_driver_s *dev,
                          const uint8_t *mac)
{
  return OK;
}

#endif /* CONFIG_NET_MCASTGROUP */

#ifdef CONFIG_NETDEV_IOCTL

/****************************************************************************
 * Name: esp_wifi_ioctl
 *
 * Description:
 *   Handle network device ioctl commands.
 *
 ****************************************************************************/

static int esp_wifi_ioctl(struct net_driver_s *dev, int cmd,
                          unsigned long arg)
{
  struct esp_wifi_priv_s *priv = (struct esp_wifi_priv_s *)dev;
  int ret = -ENOTTY;

  switch (cmd)
    {
      /* SIOCSIWSCAN - Initiate scan */

      case SIOCSIWSCAN:
        {
          ret = esp_wifi_scan(NULL, 0, NULL);
          break;
        }

      /* SIOCGIWSCAN - Get scan results */

      case SIOCGIWSCAN:
        {
          /* Scan results are stored in priv->scan_results */

          ret = OK;
          break;
        }

      default:
        {
          wifiwarn("WARNING: Unhandled ioctl: %d\n", cmd);
          break;
        }
    }

  return ret;
}

#endif /* CONFIG_NETDEV_IOCTL */

/****************************************************************************
 * Name: esp_wifi_update_link_status
 *
 * Description:
 *   Update network link status.
 *
 ****************************************************************************/

static void esp_wifi_update_link_status(struct esp_wifi_priv_s *priv,
                                        bool up)
{
  net_lock();

  if (up)
    {
      netdev_lower_carrier_on(&priv->dev);
    }
  else
    {
      netdev_lower_carrier_off(&priv->dev);
    }

  net_unlock();
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp_wifi_initialize
 *
 * Description:
 *   Initialize the ESP-Hosted WiFi driver.
 *
 ****************************************************************************/

int esp_wifi_initialize(void)
{
  struct esp_wifi_priv_s *priv = &g_esp_wifi;
  int ret;

  wifiinfo("Initializing ESP-Hosted WiFi driver\n");

  /* Initialize private data */

  memset(priv, 0, sizeof(struct esp_wifi_priv_s));

  nxmutex_init(&priv->lock);
  nxsem_init(&priv->cmd.sem, 0, 0);
  nxsem_init(&priv->scan_sem, 0, 0);

