Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_wifi.c
  priv->state = ESP_HOSTED_STATE_UNINIT;
  priv->mode  = ESP_WIFI_MODE_OFF;

  /* Allocate TX buffer */

  priv->tx_buf_size = ESP_HOSTED_MAX_FRAME_SIZE +
                      ESP_HOSTED_SDIO_BLOCK_SIZE;
  priv->tx_buf = kmm_zalloc(priv->tx_buf_size);
  if (priv->tx_buf == NULL)
    {
      wifierr("ERROR: Failed to allocate TX buffer\n");
      ret = -ENOMEM;
      goto errout_mutex;
    }

  /* Allocate RX buffer */

  priv->rx_buf_size = ESP_HOSTED_MAX_FRAME_SIZE +
                      ESP_HOSTED_SDIO_BLOCK_SIZE;
  priv->rx_buf = kmm_zalloc(priv->rx_buf_size);
  if (priv->rx_buf == NULL)
    {
      wifierr("ERROR: Failed to allocate RX buffer\n");
      ret = -ENOMEM;
      goto errout_txbuf;
    }

  /* Allocate scan results buffer */

  priv->scan_results = kmm_zalloc(
    ESP_HOSTED_MAX_SCAN_RESULTS *
    sizeof(struct esp_hosted_scan_result_s));
  if (priv->scan_results == NULL)
    {
      wifierr("ERROR: Failed to allocate scan results buffer\n");
      ret = -ENOMEM;
      goto errout_rxbuf;
    }

  /* Initialize SDIO transport */

  ret = esp_wifi_sdio_init(priv);
  if (ret < 0)
    {
      wifierr("ERROR: SDIO init failed: %d\n", ret);
      goto errout_scan;
    }

  priv->state = ESP_HOSTED_STATE_SDIO_READY;

  /* Perform firmware handshake */

  ret = esp_wifi_fw_handshake(priv);
  if (ret < 0)
    {
      wifierr("ERROR: Firmware handshake failed: %d\n", ret);
      goto errout_scan;
    }

  /* Initialize NuttX network device */

  priv->dev.d_buf     = kmm_zalloc(CONFIG_NET_ETH_PKTSIZE);
  if (priv->dev.d_buf == NULL)
    {
      ret = -ENOMEM;
      goto errout_scan;
    }

  priv->dev.d_ifup    = esp_wifi_ifup;
  priv->dev.d_ifdown  = esp_wifi_ifdown;
  priv->dev.d_txpoll  = esp_wifi_txpoll;
  priv->dev.d_transmit = esp_wifi_transmit;
  priv->dev.d_addmac  = esp_wifi_addmac;
  priv->dev.d_rmmac   = esp_wifi_rmmac;
#ifdef CONFIG_NETDEV_IOCTL
  priv->dev.d_ioctl   = esp_wifi_ioctl;
#endif

  /* Set the hardware address */

  memcpy(priv->dev.d_mac.ether.ether_addr_octet,
         priv->sta_mac, ESP_HOSTED_MAC_ADDR_LEN);

  priv->dev.d_pktsize = CONFIG_NET_ETH_PKTSIZE;

  /* Register the network device */

  ret = netdev_register(&priv->dev, NET_LL_ETHERNET);
  if (ret < 0)
    {
      wifierr("ERROR: netdev_register failed: %d\n", ret);
      goto errout_devbuf;
    }

  wifiinfo("ESP-Hosted WiFi driver initialized successfully\n");
  wifiinfo("  Interface: %s\n", ESP_HOSTED_NETDEV_NAME);
  wifiinfo("  STA MAC: %02x:%02x:%02x:%02x:%02x:%02x\n",
           priv->sta_mac[0], priv->sta_mac[1], priv->sta_mac[2],
           priv->sta_mac[3], priv->sta_mac[4], priv->sta_mac[5]);

  return OK;

errout_devbuf:
  kmm_free(priv->dev.d_buf);
errout_scan:
  kmm_free(priv->scan_results);
errout_rxbuf:
  kmm_free(priv->rx_buf);
errout_txbuf:
  kmm_free(priv->tx_buf);
errout_mutex:
  nxmutex_destroy(&priv->lock);
  nxsem_destroy(&priv->cmd.sem);
  nxsem_destroy(&priv->scan_sem);
  return ret;
}

/****************************************************************************
 * Name: esp_wifi_deinitialize
 *
 * Description:
 *   Deinitialize the ESP-Hosted WiFi driver.
 *
 ****************************************************************************/

int esp_wifi_deinitialize(void)
{
  struct esp_wifi_priv_s *priv = &g_esp_wifi;

  wifiinfo("Deinitializing ESP-Hosted WiFi driver\n");

  nxmutex_lock(&priv->lock);

  /* Stop poll worker */

  work_cancel(ESP_WIFI_WORK_LP, &priv->poll_work);

  /* Unregister network device */

  netdev_unregister(&priv->dev);

  /* Free resources */

  if (priv->dev.d_buf != NULL)
    {
      kmm_free(priv->dev.d_buf);
    }

  if (priv->scan_results != NULL)
    {
      kmm_free(priv->scan_results);
    }

  if (priv->rx_buf != NULL)
    {
      kmm_free(priv->rx_buf);
    }

  if (priv->tx_buf != NULL)
    {
      kmm_free(priv->tx_buf);
    }

  priv->state = ESP_HOSTED_STATE_UNINIT;
  priv->mode  = ESP_WIFI_MODE_OFF;

  nxmutex_unlock(&priv->lock);

  nxmutex_destroy(&priv->lock);
  nxsem_destroy(&priv->cmd.sem);
  nxsem_destroy(&priv->scan_sem);

  wifiinfo("ESP-Hosted WiFi driver deinitialized\n");

  return OK;
}

/****************************************************************************
 * Name: esp_wifi_scan
 *
 * Description:
 *   Perform WiFi scan.
 *
 ****************************************************************************/

int esp_wifi_scan(struct esp_hosted_scan_result_s *results,
                  uint8_t max_results, uint8_t *num_results)
{
  struct esp_wifi_priv_s *priv = &g_esp_wifi;
  struct esp_hosted_scan_cmd_s scan_cmd;
  uint8_t resp_buf[ESP_HOSTED_MAX_RESP_SIZE];
  uint16_t resp_len;
  int ret;

  nxmutex_lock(&priv->lock);

  if (priv->state < ESP_HOSTED_STATE_FW_READY)
    {
      nxmutex_unlock(&priv->lock);
      return -ENODEV;
    }

  /* Reset scan semaphore */

  nxsem_reset(&priv->scan_sem, 0);
  priv->scan_count = 0;

  /* Send scan command */

  memset(&scan_cmd, 0, sizeof(scan_cmd));
  scan_cmd.show_hidden = 0;

  ret = esp_wifi_send_command(priv, ESP_HOSTED_CMD_SCAN,
                              (const uint8_t *)&scan_cmd,
                              sizeof(scan_cmd),
                              resp_buf, sizeof(resp_buf), &resp_len,
                              ESP_HOSTED_SCAN_TIMEOUT_MS);
  if (ret < 0)
    {
      wifierr("ERROR: Scan command failed: %d\n", ret);
      nxmutex_unlock(&priv->lock);
      return ret;
    }

  /* Parse scan results from response */

  if (resp_len >= sizeof(struct esp_hosted_scan_resp_s))
    {
      struct esp_hosted_scan_resp_s *scan_resp =
        (struct esp_hosted_scan_resp_s *)resp_buf;

      uint8_t count = scan_resp->num_results;
      if (count > ESP_HOSTED_MAX_SCAN_RESULTS)
        {
          count = ESP_HOSTED_MAX_SCAN_RESULTS;
        }

      priv->scan_count = count;

      /* Copy results to internal buffer and optionally to caller */

      if (resp_len >= sizeof(struct esp_hosted_scan_resp_s) +
          count * sizeof(struct esp_hosted_scan_result_s))
        {
          memcpy(priv->scan_results, scan_resp->results,
                 count * sizeof(struct esp_hosted_scan_result_s));

          if (results != NULL && max_results > 0)
            {
              uint8_t copy_count = count;
              if (copy_count > max_results)
                {
                  copy_count = max_results;
                }

              memcpy(results, scan_resp->results,
                     copy_count * sizeof(struct esp_hosted_scan_result_s));

              if (num_results != NULL)
                {
                  *num_results = copy_count;
                }
            }
        }
    }

  nxmutex_unlock(&priv->lock);

