Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_wifi.c
  wifiinfo("Scan completed, %u results\n", priv->scan_count);

  return OK;
}

/****************************************************************************
 * Name: esp_wifi_connect
 *
 * Description:
 *   Connect to a WiFi network.
 *
 ****************************************************************************/

int esp_wifi_connect(const char *ssid, const char *password)
{
  struct esp_wifi_priv_s *priv = &g_esp_wifi;
  struct esp_hosted_connect_cmd_s connect_cmd;
  int ret;

  if (ssid == NULL || strlen(ssid) == 0 ||
      strlen(ssid) > ESP_HOSTED_MAX_SSID_LEN)
    {
      return -EINVAL;
    }

  nxmutex_lock(&priv->lock);

  if (priv->state < ESP_HOSTED_STATE_FW_READY)
    {
      nxmutex_unlock(&priv->lock);
      return -ENODEV;
    }

  /* Build connect command */

  memset(&connect_cmd, 0, sizeof(connect_cmd));
  strncpy(connect_cmd.ssid, ssid, ESP_HOSTED_MAX_SSID_LEN);

  if (password != NULL && strlen(password) > 0)
    {
      strncpy(connect_cmd.password, password,
              ESP_HOSTED_MAX_PASSWORD_LEN);
      connect_cmd.authmode = ESP_HOSTED_AUTH_WPA2_PSK;
    }
  else
    {
      connect_cmd.authmode = ESP_HOSTED_AUTH_OPEN;
    }

  connect_cmd.channel = 0;  /* Auto */

  /* Send connect command */

  ret = esp_wifi_send_command(priv, ESP_HOSTED_CMD_CONNECT,
                              (const uint8_t *)&connect_cmd,
                              sizeof(connect_cmd),
                              NULL, 0, NULL,
                              ESP_HOSTED_CONNECT_TIMEOUT_MS);
  if (ret < 0)
    {
      wifierr("ERROR: Connect command failed: %d\n", ret);
      nxmutex_unlock(&priv->lock);
      return ret;
    }

  priv->state = ESP_HOSTED_STATE_STA_CONNECTING;

  nxmutex_unlock(&priv->lock);

  /* Wait for connection to be established */

  ret = esp_wifi_wait_for_connection(priv,
                                     ESP_HOSTED_CONNECT_TIMEOUT_MS);
  if (ret < 0)
    {
      wifierr("ERROR: Connection timed out\n");
      return ret;
    }

  wifiinfo("Connected to '%s'\n", ssid);

  return OK;
}

/****************************************************************************
 * Name: esp_wifi_disconnect
 *
 * Description:
 *   Disconnect from the current WiFi network.
 *
 ****************************************************************************/

int esp_wifi_disconnect(void)
{
  struct esp_wifi_priv_s *priv = &g_esp_wifi;
  int ret;

  nxmutex_lock(&priv->lock);

  if (priv->state < ESP_HOSTED_STATE_FW_READY)
    {
      nxmutex_unlock(&priv->lock);
      return -ENODEV;
    }

  ret = esp_wifi_send_command(priv, ESP_HOSTED_CMD_DISCONNECT,
                              NULL, 0, NULL, 0, NULL,
                              ESP_HOSTED_CMD_TIMEOUT_MS);
  if (ret < 0)
    {
      wifierr("ERROR: Disconnect command failed: %d\n", ret);
    }

  priv->sta_connected = false;
  priv->state = ESP_HOSTED_STATE_STA_DISCONNECTED;
  esp_wifi_update_link_status(priv, false);

  nxmutex_unlock(&priv->lock);

  wifiinfo("Disconnected\n");

  return OK;
}

/****************************************************************************
 * Name: esp_wifi_softap_start
 *
 * Description:
 *   Start a soft AP.
 *
 ****************************************************************************/

int esp_wifi_softap_start(const char *ssid, const char *password,
                          uint8_t channel, uint8_t max_connections)
{
  struct esp_wifi_priv_s *priv = &g_esp_wifi;
  struct esp_hosted_softap_start_cmd_s ap_cmd;
  int ret;

  if (ssid == NULL || strlen(ssid) == 0 ||
      strlen(ssid) > ESP_HOSTED_MAX_SSID_LEN)
    {
      return -EINVAL;
    }

  nxmutex_lock(&priv->lock);

  if (priv->state < ESP_HOSTED_STATE_FW_READY)
    {
      nxmutex_unlock(&priv->lock);
      return -ENODEV;
    }

  /* Build softAP start command */

  memset(&ap_cmd, 0, sizeof(ap_cmd));
  strncpy(ap_cmd.ssid, ssid, ESP_HOSTED_MAX_SSID_LEN);

  if (password != NULL && strlen(password) > 0)
    {
      strncpy(ap_cmd.password, password, ESP_HOSTED_MAX_PASSWORD_LEN);
      ap_cmd.authmode = ESP_HOSTED_AUTH_WPA2_PSK;
    }
  else
    {
      ap_cmd.authmode = ESP_HOSTED_AUTH_OPEN;
    }

  ap_cmd.channel         = channel;
  ap_cmd.max_connections = max_connections;
  ap_cmd.ssid_hidden     = 0;
  ap_cmd.beacon_interval = 100;

  /* First set mode to AP or STA+AP */

  uint8_t mode = (priv->mode == ESP_WIFI_MODE_STA) ?
                 ESP_HOSTED_WIFI_MODE_AP_STA :
                 ESP_HOSTED_WIFI_MODE_AP;

  ret = esp_wifi_send_command(priv, ESP_HOSTED_CMD_SET_MODE,
                              &mode, 1, NULL, 0, NULL,
                              ESP_HOSTED_CMD_TIMEOUT_MS);
  if (ret < 0)
    {
      wifierr("ERROR: Failed to set AP mode: %d\n", ret);
      nxmutex_unlock(&priv->lock);
      return ret;
    }

  /* Send softAP start command */

  ret = esp_wifi_send_command(priv, ESP_HOSTED_CMD_SOFTAP_START,
                              (const uint8_t *)&ap_cmd,
                              sizeof(ap_cmd),
                              NULL, 0, NULL,
                              ESP_HOSTED_CMD_TIMEOUT_MS);
  if (ret < 0)
    {
      wifierr("ERROR: SoftAP start command failed: %d\n", ret);
      nxmutex_unlock(&priv->lock);
      return ret;
    }

  if (priv->mode == ESP_WIFI_MODE_STA)
    {
      priv->mode = ESP_WIFI_MODE_STA_AP;
    }
  else
    {
      priv->mode = ESP_WIFI_MODE_AP;
    }

  priv->state = ESP_HOSTED_STATE_AP_ACTIVE;

  nxmutex_unlock(&priv->lock);

  wifiinfo("SoftAP started: SSID='%s', channel=%u\n", ssid, channel);

  return OK;
}

/****************************************************************************
 * Name: esp_wifi_softap_stop
 *
 * Description:
 *   Stop the soft AP.
 *
 ****************************************************************************/

int esp_wifi_softap_stop(void)
{
  struct esp_wifi_priv_s *priv = &g_esp_wifi;
  int ret;

  nxmutex_lock(&priv->lock);

  if (priv->state != ESP_HOSTED_STATE_AP_ACTIVE)
    {
      nxmutex_unlock(&priv->lock);
      return -EINVAL;
    }

