Geoorgiee/contest2026_324_xiaoqiaoliushui/vendor_esp32p4/chips/esp32p4/esp32p4_wifi.c
  ret = esp_wifi_send_command(priv, ESP_HOSTED_CMD_SOFTAP_STOP,
                              NULL, 0, NULL, 0, NULL,
                              ESP_HOSTED_CMD_TIMEOUT_MS);
  if (ret < 0)
    {
      wifierr("ERROR: SoftAP stop command failed: %d\n", ret);
    }

  if (priv->mode == ESP_WIFI_MODE_STA_AP)
    {
      priv->mode = ESP_WIFI_MODE_STA;
      priv->state = priv->sta_connected ?
                    ESP_HOSTED_STATE_STA_CONNECTED :
                    ESP_HOSTED_STATE_STA_DISCONNECTED;
    }
  else
    {
      priv->mode = ESP_WIFI_MODE_OFF;
      priv->state = ESP_HOSTED_STATE_FW_READY;
    }

  nxmutex_unlock(&priv->lock);

  wifiinfo("SoftAP stopped\n");

  return OK;
}

/****************************************************************************
 * Name: esp_wifi_get_rssi
 *
 * Description:
 *   Get the current RSSI.
 *
 ****************************************************************************/

int esp_wifi_get_rssi(int8_t *rssi)
{
  struct esp_wifi_priv_s *priv = &g_esp_wifi;
  struct esp_hosted_rssi_resp_s rssi_resp;
  uint16_t resp_len;
  int ret;

  if (rssi == NULL)
    {
      return -EINVAL;
    }

  nxmutex_lock(&priv->lock);

  if (!priv->sta_connected)
    {
      nxmutex_unlock(&priv->lock);
      return -ENOTCONN;
    }

  ret = esp_wifi_send_command(priv, ESP_HOSTED_CMD_GET_RSSI,
                              NULL, 0,
                              (uint8_t *)&rssi_resp,
                              sizeof(rssi_resp), &resp_len,
                              ESP_HOSTED_CMD_TIMEOUT_MS);
  if (ret < 0)
    {
      nxmutex_unlock(&priv->lock);
      return ret;
    }

  *rssi = rssi_resp.rssi;
  priv->rssi = rssi_resp.rssi;

  nxmutex_unlock(&priv->lock);

  return OK;
}

/****************************************************************************
 * Name: esp_wifi_get_mac
 *
 * Description:
 *   Get the MAC address of the specified interface.
 *
 ****************************************************************************/

int esp_wifi_get_mac(uint8_t iface, uint8_t *mac)
{
  struct esp_wifi_priv_s *priv = &g_esp_wifi;

  if (mac == NULL || iface >= ESP_HOSTED_IFACE_MAX)
    {
      return -EINVAL;
    }

  nxmutex_lock(&priv->lock);

  if (iface == ESP_HOSTED_IFACE_STA)
    {
      memcpy(mac, priv->sta_mac, ESP_HOSTED_MAC_ADDR_LEN);
    }
  else
    {
      memcpy(mac, priv->ap_mac, ESP_HOSTED_MAC_ADDR_LEN);
    }

  nxmutex_unlock(&priv->lock);

  return OK;
}

/****************************************************************************
 * Name: esp_wifi_set_tx_power
 *
 * Description:
 *   Set the WiFi TX power.
 *
 ****************************************************************************/

int esp_wifi_set_tx_power(int8_t power_dbm)
{
  struct esp_wifi_priv_s *priv = &g_esp_wifi;
  struct esp_hosted_tx_power_s tx_power;
  int ret;

  if (power_dbm < ESP_HOSTED_TX_POWER_MIN ||
      power_dbm > ESP_HOSTED_TX_POWER_MAX)
    {
      return -EINVAL;
    }

  nxmutex_lock(&priv->lock);

  tx_power.power_dbm = power_dbm;

  ret = esp_wifi_send_command(priv, ESP_HOSTED_CMD_SET_TX_POWER,
                              (const uint8_t *)&tx_power,
                              sizeof(tx_power),
                              NULL, 0, NULL,
                              ESP_HOSTED_CMD_TIMEOUT_MS);

  nxmutex_unlock(&priv->lock);

  return ret;
}

/****************************************************************************
 * Name: esp_wifi_get_tx_power
 *
 * Description:
 *   Get the current WiFi TX power.
 *
 ****************************************************************************/

int esp_wifi_get_tx_power(int8_t *power_dbm)
{
  struct esp_wifi_priv_s *priv = &g_esp_wifi;
  struct esp_hosted_tx_power_s tx_power;
  uint16_t resp_len;
  int ret;

  if (power_dbm == NULL)
    {
      return -EINVAL;
    }

  nxmutex_lock(&priv->lock);

  ret = esp_wifi_send_command(priv, ESP_HOSTED_CMD_GET_TX_POWER,
                              NULL, 0,
                              (uint8_t *)&tx_power,
                              sizeof(tx_power), &resp_len,
                              ESP_HOSTED_CMD_TIMEOUT_MS);
  if (ret < 0)
    {
      nxmutex_unlock(&priv->lock);
      return ret;
    }

  *power_dbm = tx_power.power_dbm;

  nxmutex_unlock(&priv->lock);

  return OK;
}

/****************************************************************************
 * Name: esp_wifi_wait_for_connection
 *
 * Description:
 *   Wait for STA connection to be established.
 *
 ****************************************************************************/

static int esp_wifi_wait_for_connection(struct esp_wifi_priv_s *priv,
                                        uint32_t timeout_ms)
{
  uint32_t start_tick;
  uint32_t elapsed;

  start_tick = clock_systime_ticks();

  while (true)
    {
      if (priv->state == ESP_HOSTED_STATE_STA_CONNECTED)
        {
          return OK;
        }

      if (priv->state != ESP_HOSTED_STATE_STA_CONNECTING)
        {
          return -ECONNREFUSED;
        }

      elapsed = TICK2MSEC(clock_systime_ticks() - start_tick);
      if (elapsed >= timeout_ms)
        {
          return -ETIMEDOUT;
        }

      up_mdelay(100);
    }
}
